## Homework5 review

### Review notes:
1. Не перемещайте \_\_init__.py file
2. Не удаляйте \_\_init__.py file
3. Пожалуйста, удалите ненужные комментарии
4. Пожалуйста, именуйте файлы с заданием по шаблону
5. Проверьте строку перед тем как переводить в число через .isdigit() или try-except
6. Проверьте и уберите лишние print()
7. Название переменных не отражают суть того, что в них содержится
8. try-except блок должен оборачивать только те строчки в которых может произойти ожидаемая ошибка
9. Добавьте описание задач в шапку файла
10. Удалите ненужные переменные
11. Task 1. Проверяйте знак через отдельные if-elif выражения
12. Task 2. Задание можно решить через цикл:
```python
while full_number > 0:
    part_number = full_number % 10  # получить цифру из числа
    full_number = full_number // 10 # убрать цифру из числа
    # ...
```
13. Task 3. Вложенный цикл можно делать range(1, int(chi/2)) до половины числа. Делитель не может быть больше половины
14. Task 5. Найдите максимальное число через max()
15. Task 6. В последовательности должно может быть больше чем 3 числа. Следует проверять возрастание до тех пор, пока не появиться число меньше предыдущего. Если такое встретилось и ранее была найдена последовательность, то увеличивайте счетчик
16. Task 7. Найдите максимальное число через max()
17. Task 7. обмен реализуйте через a, b = b, a
18. Task 8. Разделить строки на пробелы через .split(' ')
19. Task 8. Перевернуть строку через s[::-1]
20. Task 9. Вложенный цикл можно делать range(2, int(chi/2)) до половины числа. Делитель не может быть больше половины
